#pragma once

namespace UnityEngine
{
	struct Matrix4x4
	{
	public:
		float m00; // 0x0
		float m10; // 0x4
		float m20; // 0x8
		float m30; // 0xC
		float m01; // 0x10
		float m11; // 0x14
		float m21; // 0x18
		float m31; // 0x1C
		float m02; // 0x20
		float m12; // 0x24
		float m22; // 0x28
		float m32; // 0x2C
		float m03; // 0x30
		float m13; // 0x34
		float m23; // 0x38
		float m33; // 0x3C
	};
}